# GetWeights Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
NurbsSurfaceData..::..GetWeights Method
NurbsSurfaceData Class See Also
---
Get the list of weights.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public IList<double> GetWeights()
```

Visual Basic
---
```text
Public Function GetWeights As IList(Of Double)
```

Visual C++
---
```text
public:
IList<double>^ GetWeights()
```

# See Also
NurbsSurfaceData Class
Autodesk.Revit.DB Namespace